mylist = [1, 2, 3, 4, 5, 6] #=> [[1, 2, 3], [4, 5, 6]] (СПИСОК ДІЛИТЬСЯ РІВНО НАВПІЛ)
# mylist = [1, 2, 3] #=> [[1, 2], [3]] (ПЕРША ЧАСТИНА СПИСКУ БІЛЬША ПРИ НЕПАРНІЙ КІЛЬКОСТІ)
# mylist = [1, 2, 3, 4, 5] #=> [[1, 2, 3], [4, 5]] 
# mylist = [1] #=> [[1], []] (СПИСОК З ОДНИМ ЕЛЕМЕНТОМ)
# mylist = [] #=> [[], []] (ПУСТИЙ СПИСОК)
if len(mylist) == 0:
    result = [[], []]
else:
    mid = (len(mylist) + 1) // 2
    result = [mylist[:mid], mylist[mid:]]
print(result)

""" Приклад
[1, 2, 3, 4, 5, 6] => [[1, 2, 3], [4, 5, 6]]
[1, 2, 3] => [[1, 2], [3]]
[1, 2, 3, 4, 5] => [[1, 2, 3], [4, 5]]
[1] => [[1], []]
[] => [[], []]
"""