mylist = [12, 3, 4, 10] # => [10, 12, 3, 4] (ЗВИЧАЙНИЙ СПИСОК)
# mylist = [1] # => [1] (СПИСОК З ОДНИМ ЕЛЕМЕНТОМ)
# mylist = [] # => [] (ПУСТИЙ СПИСОК)
# mylist = [12, 3, 4, 10, 8]
if len(mylist) > 0: # Якщо кількість елементів в списку є більшим ніж 0, в інакшому випадку VS Code видає помилку обробки пустого списку
    last = mylist.pop() # Забрати останній елемент
    mylist.insert(0, last) # Перемістити останній елемент на початок (На індекс 0)


print(mylist)


""" Приклад
[12, 3, 4, 10] => [10, 12, 3, 4]
[1] => [1]
[] => []
[12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]
"""